{
   "autoregistration": "Active Zabbix agent may automatically register a host on the Zabbix server. See https://www.zabbix.com/documentation/3.0/manual/discovery/auto_registration",
   "sender": "Commandline utility zabbix_sender. Allows to send arbitrary values to \"Zabbix trapper\" items. See https://www.zabbix.com/documentation/3.0/manpages/zabbix_sender",
   "appliance": "Zabbix virtual appliance. See https://www.zabbix.com/documentation/3.0/manual/appliance",
   "remotecommands": "Ability to run commands on Zabbix agents. See https://www.zabbix.com/documentation/3.0/manual/config/notifications/action/operation/remote_command",
   "ServerActive": "Agent config param. Server or proxy to connect to. Multiple comma-delimited entries will make agent work with each server separately. Port can be delimited with a colon. See http://blog.zabbix.com/multiple-servers-for-active-agent-sure and https://www.zabbix.com/documentation/3.0/manual/appendix/config/zabbix_agentd",
   "externalchecks": "Scripts that are run directly by Zabbix server or proxy. Must be located in a directory, specified in the 'ExternalScripts' server/proxy parameter. Parameters are comma-separated in the item key. See https://www.zabbix.com/documentation/3.0/manual/config/items/itemtypes/external",
   "LLD": "Low level discovery. Allows Zabbix to discover filesystems, network interfaces, CPUs, SNMP OIDs and other things. See https://www.zabbix.com/documentation/3.0/manual/discovery/low_level_discovery",
   "compatibility": "Zabbix server and proxies must be same major version (2.4.2 and 2.4.4 is ok); all older agent versions are supported down to 1.0; agents more recent than server/proxy are not supported. See https://www.zabbix.com/documentation/3.0/manual/appendix/compatibility",
   "ask": "Do not ask for a permission to ask a question. Ask right away to save time. Be specific right away so others do not have to spend time on clarifying the details you could have provided early on.",
   "timeshift": "Trigger function parameter that makes the function act as if it was transported some time ago. See https://www.zabbix.com/documentation/3.0/manual/config/triggers/expression",
   "usermacros": "User macros (think of them as variables) allow to override trigger thresholds and function parameters, SNMP community and other parameters per host even if items come from a single template. See https://www.zabbix.com/documentation/3.0/manual/config/macros/usermacros",
   "discovery": "Always clarify what type of discovery a question is about - Zabbix has network discovery, low level discovery and active agent auto-registration.",
   "aggregateitems": "Aggregate items allow to calculate data across hostgroups - for example, average queries per second across all database servers or total diskspace on all fileservers. see https://www.zabbix.com/documentation/3.0/manual/config/items/itemtypes/aggregate",
   "trunk": "Zabbix uses Subversion for version control. The most recent development branch is called \"trunk\" - it will become the next major release. Testing it allows to see new features early and can influence Zabbix development. See https://www.zabbix.org/wiki/Get_Zabbix",
   "macros": "Macros (think of them as variables) in Zabbix allow to customise notifications, write more complex trigger expressions and lots of other things. See https://www.zabbix.com/documentation/3.0/manual/appendix/macros/supported_by_location",
   "conference": "Zabbix conference in September 11-12, 2015. Riga, Latvia. Two days packed with interesting topics. See http://www.zabbix.com/conference2015.php",
   "RMB": "Rīgas melnais balzams - Riga Black Balsam. Alcoholic drink in ceramic bottles, Riga specialty. Taken as a souvenir from trips to Riga",
   "beer": "Annual tasting of Latvian beer happens in September, during the Zabbix conference",
   "Riga": "Riga - capital of Latvia. Prettiest city in Europe according to USA Today. http://osm.org/go/0wMg--?m= https://en.wikivoyage.org/wiki/Riga",
   "maintenance": "Maintenance can be on host or host group level. One-time or recurring daily, weekly, monthly. See https://www.zabbix.com/documentation/3.0/manual/maintenance",
   "API": "Zabbix JSON-RPC API. Allows to automate most of the Zabbix configuration. See https://www.zabbix.com/documentation/3.0/manual/api",
   "alertscripts": "Ability to run a custom script from an action. Configured as a media type, must be located in AlertScriptsPath (server conf) directory. 'Send to' from user media, subject and msg body from action are passed to it as $1-3. See https://www.zabbix.com/documentation/3.0/manual/config/notifications/media/script",
   "activeagent": "Connects to the Zabbix server. Can send multiple values in one connection. See ServerActive and https://www.zabbix.com/documentation/3.0/manual/appendix/items/activepassive#active_checks",
   "passiveagent": "Is contacted by the Zabbix server. One value per connection. See https://www.zabbix.com/documentation/3.0/manual/appendix/items/activepassive#passive_checks",
   "agent": "Native monitoring agent on Linux, Windows and most UNIX systems. Can operate in active and passive mode at the same time. See activeagent, passiveagent and https://www.zabbix.com/documentation/3.0/manual/concepts/agent",
   "agentpassive": "alias:passiveagent",
   "agentactive": "alias:activeagent",
   "globalregexp": "A global regular expression, defined in Administration -> General -> Regular expressions. Can be used in LLD, logfile filtering and some other places. See https://www.zabbix.com/documentation/3.0/manual/regular_expressions",
   "userparameter": "Any command, executed on the agent side that returns values for items. The most popular way to extend agent data collection. See https://www.zabbix.com/documentation/3.0/manual/config/items/userparameters",
   "protocols": "Protocols, used between different Zabbix components. See https://www.zabbix.org/wiki/Docs/protocols",
   "proxy": "Zabbix proxy is a remote data collector. Supports all collecting methods that server supports. Has a local database and can buffer values if server is not reachable. See https://www.zabbix.com/documentation/3.0/manual/distributed_monitoring/proxies",
   "proxies": "alias:proxy",
   "regexp": "Zabbix daemons use POSIX EXTENDED, frontend - PCRE. Note that global regexp testing can return different results from the actual daemon result, do not use PCRE features like lookarounds or PCRE character class syntax"
}
