{
   "autoregistration": "Active Zabbix agent may automatically register a host on the Zabbix server. See https://www.zabbix.com/documentation/3.0/manual/discovery/auto_registration",
   "sender": "Commandline utility zabbix_sender. Allows to send arbitrary values to \"Zabbix trapper\" items. See https://www.zabbix.com/documentation/3.0/manpages/zabbix_sender",
   "appliance": "Zabbix virtual appliance. See https://www.zabbix.com/documentation/3.0/manual/appliance",
   "remotecommands": "Ability to run commands on Zabbix agents. See https://www.zabbix.com/documentation/3.0/manual/config/notifications/action/operation/remote_command",
   "ServerActive": "Agent config param. Server or proxy to connect to. Multiple comma-delimited entries will make agent work with each server separately. Port can be delimited with a colon. See http://blog.zabbix.com/multiple-servers-for-active-agent-sure and https://www.zabbix.com/documentation/3.0/manual/appendix/config/zabbix_agentd",
   "externalchecks": "Scripts that are run directly by Zabbix server or proxy. Must be located in a directory, specified in the 'ExternalScripts' server/proxy parameter. Parameters are comma-separated in the item key. See https://www.zabbix.com/documentation/3.0/manual/config/items/itemtypes/external",
   "LLD": "Low level discovery. Allows Zabbix to discover filesystems, network interfaces, CPUs, SNMP OIDs and other things. See https://www.zabbix.com/documentation/3.0/manual/discovery/low_level_discovery",
   "compatibility": "Zabbix server and proxies must be same major version (2.4.2 and 2.4.4 is ok), ZBXNEXT-2557 asks for proxy backward support; all older agent versions are supported down to 1.0; agents more recent than server/proxy are not supported. See https://www.zabbix.com/documentation/3.0/manual/appendix/compatibility",
   "ask": "Do not ask for a permission to ask a question. Ask right away to save time. Be specific right away so others do not have to spend time on clarifying the details you could have provided early on.",
   "timeshift": "Trigger function parameter that makes the function act as if it was transported some time ago. See https://www.zabbix.com/documentation/3.0/manual/config/triggers/expression",
   "usermacros": "User macros (think of them as variables) allow to override trigger thresholds and function parameters, SNMP community and other parameters per host even if items come from a single template. See macrocontext and https://www.zabbix.com/documentation/3.0/manual/config/macros/usermacros",
   "discovery": "Always clarify what type of discovery a question is about - Zabbix has network discovery, low level discovery and active agent auto-registration.",
   "aggregateitems": "Aggregate items allow to calculate data across hostgroups - for example, average queries per second across all database servers or total diskspace on all fileservers. see https://www.zabbix.com/documentation/3.0/manual/config/items/itemtypes/aggregate",
   "trunk": "Zabbix uses Subversion for version control. The most recent development branch is called \"trunk\" - it will become the next major release. Testing it allows to see new features early and can influence Zabbix development. See https://www.zabbix.org/wiki/Get_Zabbix",
   "macros": "Macros (think of them as variables) in Zabbix allow to customise notifications, write more complex trigger expressions and lots of other things. See https://www.zabbix.com/documentation/3.0/manual/appendix/macros/supported_by_location",
   "conference": "Zabbix yearly conference in 2016 will happen September 9-10 in Riga, Latvia. Two days packed with interesting topics",
   "RMB": "Rīgas melnais balzams - Riga Black Balsam. Alcoholic drink in ceramic bottles, Riga specialty. Taken as a souvenir from trips to Riga",
   "beer": "Annual tasting of Latvian beer happens in September, during the Zabbix conference",
   "Riga": "Riga - capital of Latvia. Prettiest city in Europe according to USA Today. http://osm.org/go/0wMg--?m= https://en.wikivoyage.org/wiki/Riga",
   "maintenance": "Maintenance can be on host or host group level. One-time or recurring daily, weekly, monthly. See https://www.zabbix.com/documentation/3.0/manual/maintenance",
   "API": "Zabbix JSON-RPC API. Allows to automate most of the Zabbix configuration. See https://www.zabbix.com/documentation/3.0/manual/api",
   "alertscripts": "Ability to run a custom script from an action. Configured as a media type, must be located in AlertScriptsPath (server conf) directory. 'Send to' from user media, subject and msg body from action are passed to it as $1-3. See https://www.zabbix.com/documentation/3.0/manual/config/notifications/media/script",
   "activeagent": "Connects to the Zabbix server. Can send multiple values in one connection. Parameter Hostname in agent config file must match host name on server. See ServerActive and https://www.zabbix.com/documentation/3.0/manual/appendix/items/activepassive#active_checks",
   "passiveagent": "Is contacted by the Zabbix server. One value per connection. See https://www.zabbix.com/documentation/3.0/manual/appendix/items/activepassive#passive_checks",
   "agent": "Native monitoring agent on Linux, Windows and most UNIX systems. Can operate in active and passive mode at the same time. See activeagent, passiveagent and https://www.zabbix.com/documentation/3.0/manual/concepts/agent",
   "agentpassive": "alias:passiveagent",
   "agentactive": "alias:activeagent",
   "globalregexp": "A global regular expression, defined in Administration -> General -> Regular expressions. Can be used in LLD, logfile filtering and some other places. See https://www.zabbix.com/documentation/3.0/manual/regular_expressions",
   "userparameter": "Any command, executed on the agent side that returns values for items. The most popular way to extend agent data collection. See https://www.zabbix.com/documentation/3.0/manual/config/items/userparameters",
   "protocols": "Protocols, used between different Zabbix components. See https://www.zabbix.org/wiki/Docs/protocols",
   "proxy": "Zabbix proxy is a remote data collector. Supports all collecting methods that server supports. Has a local database and can buffer values if server is not reachable. See https://www.zabbix.com/documentation/3.0/manual/distributed_monitoring/proxies",
   "proxies": "alias:proxy",
   "regexp": "Zabbix daemons use POSIX EXTENDED, frontend - PCRE. Note that global regexp testing can return different results from the actual daemon result, do not use PCRE features like lookarounds or PCRE character class syntax. See also globalregexp",
   "xml": "Zabbix hosts, templates, maps and screens can be exported to XML and imported. With maps, used images are exported (base64). With hosts/templates host groups are exported. Import down to the 1.8 XML format is supported. See https://www.zabbix.com/documentation/3.0/manual/xml_export_import",
   "valuemapping": "Ability to show human readable values for numeric codes like 1->Available in the frontend and notifications. Several value maps are preconfigured in Zabbix, Administration -> General -> Value mapping. No API or XML import/export support. See https://www.zabbix.com/documentation/3.0/manual/config/items/mapping",
   "troubleshooting": "Agent does not work? Escalations do not stop? Some common troubleshooting steps at https://www.zabbix.org/wiki/Troubleshooting",
   "logmonitoring": "Zabbix agent (active) can monitor logfiles, key 'log'. Filtering by regexp supported, values can be extracted. Rotated logfile monitoring supported, key 'logrt'. See https://www.zabbix.com/documentation/3.0/manual/config/items/itemtypes/log_items",
   "logging": "Zabbix daemon log level can be changed runtime and for individual subprocesses, see http://blog.zabbix.com/zabbix-2-4-features-part-6-runtime-loglevel-changing",
   "loglevel": "alias:logging",
   "internalmonitoring": "Internal items can help to figure out how full caches are, how busy internal processes are etc. This can be used to determine how many processes are needed. Zabbix ships with default templates for internal monitoring. See http://blog.zabbix.com/monitoring-how-busy-zabbix-processes-are and https://www.zabbix.com/documentation/3.0/manual/config/items/itemtypes/internal",
   "frontendnotifications": "Zabbix may show popup notifications in the frontend with sound alarms. Configurable in user profile, may be limited by severity. See https://www.zabbix.com/documentation/3.0/manual/web_interface/user_profile/global_notifications",
   "housekeeper": "Internal process, removes history & trend data past retention periods/for deleted items, events, alerts, IT service & audit data, user sessions. Configurable in Administration->General->Housekeeping. Disabled after upgrade to 2.2",
   "application": "A way to group items. Used in latest data page, can be used in various filters and action conditions. See https://www.zabbix.com/documentation/3.0/manual/config/items/applications",
   "triggers": "Triggers allow to define what a problem is, whether it's a simple threshold or a complex expression. Actual definition is supplied as an expression. Triggers may reference multiple items from multiple hosts. There are trigger 6 severities and triggers may depend on one another. See triggerfunctions, triggerdependencies and https://www.zabbix.com/documentation/3.0/manual/config/triggers/expression",
   "triggerfunctions": "Keywords that tell how to evaluate the data in trigger expressions. Popular functions include last(), min(), max(), avg(), nodata() and count(). See https://www.zabbix.com/documentation/3.0/manual/appendix/triggers/functions",
   "roadmap": "Zabbix roadmap: https://www.zabbix.org/wiki/Docs/roadmap",
   "bugreporting": "Bug reporting guidelines: English only, test latest version, describe everything in the issue itself, no \"me too\" comments. See https://www.zabbix.org/wiki/Docs/bug_reporting_guidelines",
   "vmware": "Built-in VMware monitoring connects to vCenter or vSphere. Can automatically discover hypervisors and virtual machines. Easiest is to use the default template \"Template Virt VMware\". See https://www.zabbix.com/documentation/3.0/manual/vm_monitoring",
   "whatsnew": "To find out what new features and improvements appeared in a specific version or will appear in an upcoming one, check the wonderful \"What's new\" pages in the manual. See the corresponding version, for example https://www.zabbix.com/documentation/3.0/manual/introduction/whatsnew300",
   "actionlog": "If you expect to but get no messages, check actionlog first. Reports -> Action log (Administration -> Audit -> Actions before 3.0). See https://www.zabbix.com/documentation/3.0/manual/web_interface/frontend_sections/reports/action_log",
   "items": "Data collection entities, might be known as \"metrics\" in other solutions. See various item types at https://www.zabbix.com/documentation/3.0/manual/config/items/itemtypes",
   "demo": "Online Zabbix development version demo at http://zabbix.org/zabbix/",
   "calculateditems": "Calculated items allow to write a formula, referencing other items on the same or other hosts. Trigger functions may be used in the formula. See https://www.zabbix.com/documentation/3.0/manual/config/items/itemtypes/calculated",
   "svn": "Zabbix source code is stored in an SVN repository. Get development versions as per http://zabbix.org/wiki/Get_Zabbix#Development_versions and see http://zabbix.org/wiki/Compilation_instructions#From_SVN_checkout on how to compile them",
   "quoting": "In Zabbix, always use doublequotes. Single quotes not supported for item key parameters, Zabbix is not a shell.",
   "webmonitoring": "Zabbix has a built-in web monitoring, based on libcurl (JavaScript not supported). Scenarios with steps can be configured, HTTP proxies, basic & NTLM & SSL auth and other features are available. See https://www.zabbix.com/documentation/3.0/manual/web_monitoring",
   "inventory": "Zabbix suports host inventory that can be manually or automatically (items can put values in inventory fields) populated. See https://www.zabbix.com/documentation/3.0/manual/config/hosts/inventory",
   "time-based": "Trigger functions nodata(), fuzzytime, now() and others are said to be time-based. If trigger expression includes at least one time-based function, trigger is recalculated every 30 seconds. See https://www.zabbix.com/documentation/3.0/manual/config/triggers",
   "simplechecks": "Zabbix item type that is executed from server or proxy. Includes TCP port, basic service and ICMP items. See https://www.zabbix.com/documentation/3.0/manual/config/items/itemtypes/simple_checks and https://www.zabbix.com/documentation/3.0/manual/appendix/items/service_check_details and icmppingitems",
   "zabconf": "alias:conference",
   "interface": "Zabbix hosts can have interfaces of 4 types - passive agent, SNMP, JMX and IPMI. Interface must be present to add items of that type. Interfaces, used in items, cannot be removed. If there are no items of that type, interface is ignored.",
   "macrocontext": "Usermacros can have context applied. When looking up, if no context macro exists, lookup falls back to plain macro name. If {$THRESHOLD:/home} is not present, value of {$THRESHOLD} is used. See macrocontext",
   "networkdiscovery": "Zabbix can scan an IP range for various services using discovery rules, actions can add hosts, link them to templates, add to groups. See https://www.zabbix.com/documentation/3.0/manual/discovery/network_discovery",
   "configcache": "Configuration cache holds host, item, trigger and other configuration information. By default updated every 60 seconds, parameter CacheUpdateFrequency. Default size 8MB, parameter CacheSize. If increasing, might hit shared memory limits. See https://www.zabbix.org/wiki/How_to/configure_shared_memory",
   "valuecache": "Holds item values, used in triggers/calculated&aggregate items/notifications and elsewhere. Default size of 8MB has to be increased in bigger instances - config param ValueCacheSize. See https://www.zabbix.com/documentation/3.0/manual/config/items/value_cache",
   "globalscripts": "Scripts configured in Administration -> Scripts, shown in the host popup menus in Dashboard, Latest data, Overview, Events, Triggers, Maps and host inventory. Nesting possible with /. Always redirect STDERR to STDOUT. Reusable in action operations. See https://www.zabbix.com/documentation/3.0/manual/web_interface/frontend_sections/administration/scripts",
   "escalations": "Alerts can be delayed, repeated, escalated to another user or group. Escalation can stop when the problem is acknowledged. See https://www.zabbix.com/documentation/3.0/manual/config/notifications/action/escalations",
   "triggerdependencies": "Triggers may depend on one another. Dependent triggers are hidden in the frontend if their dependency is in a PROBLEM state. Actions don't fire for dependent triggers. Dependencies can be nested. Multiple dependencies are OR-ed, only. See https://www.zabbix.com/documentation/3.0/manual/config/triggers/dependencies",
   "dependencies": "alias:triggerdependencies",
   "forceitempolling": "Polled Zabbix items are checked on a fixed schedule. There is no way to force-poll or speed up polling of any item in Zabbix, including unsupported items. Vote on https://support.zabbix.com/browse/ZBXNEXT-473",
   "webscenarios": "alias:webmonitoring",
   "templates": "To manage items, triggers, custom graphs and other entities on multiple hosts, use templates. Templates are linked to hosts. Groups are used to organise templates themselves, adding a template to a group does not affect the hosts in that group. See https://www.zabbix.com/documentation/3.0/manual/config/templates/template and https://www.zabbix.org/wiki/Zabbix_Templates",
   "templating": "alias:templates",
   "linkindicators": "Multiple triggers may be assigned to network map links. The active trigger with the highest severity will determine the link colour and style (like line, dashed line, bold line etc). See https://www.zabbix.com/documentation/3.0/manual/config/visualisation/maps/links",
   "networkmaps": "Network maps are fixed areas that may hold plain images or show status of triggers, hosts, host groups or other maps. Links can connect elements and item data can be displayed in element and link labels. Link colour can change based on triggers. See https://www.zabbix.com/documentation/3.0/manual/config/visualisation/maps/map and linkindicators",
   "triggerhysteresis": "Triggers can be made to fire at one threshold, but resolve at another (sort of having a state memory, hysteresis). That's one way to reduce trigger flapping. Zabbix 3.2 will change this feature. See https://www.zabbix.com/documentation/2.4/manual/config/triggers/expression#hysteresis",
   "triggerhysteresis": "alias:hysteresis",
   "alias:triggerflapping": "alias:hysteresis",
   "flapping": "alias:hysteresis",
   "fping": "Zabbix uses fping utility for ICMP ping items. fping3 supported since 2.2.12/2.4.8/3.0.2. Most distributions have separate fping and fping6 binaries for IPv4 and IPv6, full path to them configured in server/proxy config. fping must be setuid root. See https://www.zabbix.com/documentation/2.0/manual/config/items/itemtypes/simple_checks#icmp_pings",
   "icmppingitems": "icmpping/icmppingloss/icmppingsec internal checks allow specifying packet count, size, interval and timeout. These items use fping. See https://www.zabbix.com/documentation/2.0/manual/config/items/itemtypes/simple_checks and fping"
}
